; domain
(define (domain cat)
    (:requirements :strips)
    (:types cat mouse wall trap square)
    (:predicates
        (at ?who ?where)
        (adj ?s1 ?s2 - square)
        (dead ?m)
        (has ?who ?what)
    )

    (:action move
        :parameters (?c - cat ?s1 - square ?s2 - square)
        :precondition (and 
            (not (dead ?c))
            (adj ?s1 ?s2)
            (at ?c ?s1)
            (not (exists (?w - wall) (at ?w ?s2)))
        )
        :effect (and 
            (not (at ?c ?s1))
            (when (exists (?t - trap) (at ?t ?s2)) (dead ?c))
            (when (not(exists (?t - trap) (at ?t ?s2))) (at ?c ?s2))
        )
    )
  
    (:action eat
        :parameters (?c - cat ?s - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (at ?m ?s) 
            (at ?c ?s)
            (not (exists (?m1 - mouse) (has ?c ?m1)))
        )
        :effect (and 
            (not (at ?m ?s)) 
            (dead ?m)
        )
    )

    (:action grab
        :parameters (?c - cat ?s - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (at ?m ?s) 
            (at ?c ?s)
            (not (exists (?m1 - mouse) (has ?c ?m1)))
        )
        :effect (and 
            (not (at ?m ?s)) 
            (has ?c ?m)
        )
    )

    (:action disable-trap
        :parameters (?c - cat ?s1 - square ?s2 - square ?m - mouse ?t - trap)
        :precondition (and 
            (not (dead ?c))
            (adj ?s1 ?s2)
            (at ?c ?s1)
            (at ?t ?s2)
            (has ?c ?m) 
        )
        :effect (and 
            (not (at ?t ?s2)) 
            (dead ?m)
            (not (has ?c ?m))
        )
    )

    (:action drop
        :parameters (?c - cat ?s - square ?s2 - square ?m - mouse)
        :precondition (and 
            (not (dead ?c))
            (has ?c ?m) 
            (at ?c ?s)
            (adj ?s ?s2)
        )
        :effect (and 
            (not (has ?c ?m))            
            (at ?m ?s2)
        )
    )
)

; problem
(define (problem cat-p08)
    (:domain cat)
    (:objects
        c - cat
        m1 m2 m3 m4 m5 m6 m7 m8 - mouse
        w1 w2 w3 w4 w5 - wall
        t1 t2 t3 t4 t5 - trap
        s11 s12 s13 s14 s15 s16
        s21 s22 s23 s24 s25 s26
        s31 s32 s33 s34 s35 s36
        s41 s42 s43 s44 s45 s46
        s51 s52 s53 s54 s55 s56
        s61 s62 s63 s64 s65 s66
        - square
    )

    (:init
        ; square adjacency
        (adj s11 s12) (adj s12 s11)
        (adj s11 s21) (adj s21 s11)
        (adj s12 s13) (adj s13 s12)
        (adj s12 s22) (adj s22 s12)
        (adj s13 s14) (adj s14 s13)
        (adj s13 s23) (adj s23 s13)
        (adj s14 s15) (adj s15 s14)
        (adj s14 s24) (adj s24 s14)
        (adj s15 s16) (adj s16 s15)
        (adj s15 s25) (adj s25 s15)
        (adj s16 s26) (adj s26 s16)
        (adj s21 s22) (adj s22 s21)
        (adj s21 s31) (adj s31 s21)
        (adj s22 s23) (adj s23 s22)
        (adj s22 s32) (adj s32 s22)
        (adj s23 s24) (adj s24 s23)
        (adj s23 s33) (adj s33 s23)
        (adj s24 s25) (adj s25 s24)
        (adj s24 s34) (adj s34 s24)
        (adj s25 s26) (adj s26 s25)
        (adj s25 s35) (adj s35 s25)
        (adj s26 s36) (adj s36 s26)
        (adj s31 s32) (adj s32 s31)
        (adj s31 s41) (adj s41 s31)
        (adj s32 s33) (adj s33 s32)
        (adj s32 s42) (adj s42 s32)
        (adj s33 s34) (adj s34 s33)
        (adj s33 s43) (adj s43 s33)
        (adj s34 s44) (adj s44 s34)
        (adj s34 s35) (adj s35 s34)
        (adj s34 s44) (adj s34 s44)
        (adj s35 s36) (adj s36 s35)
        (adj s35 s45) (adj s45 s35)
        (adj s36 s46) (adj s46 s36)
        (adj s41 s42) (adj s42 s41)
        (adj s41 s51) (adj s41 s51)
        (adj s42 s43) (adj s43 s42)
        (adj s42 s52) (adj s52 s42)
        (adj s43 s44) (adj s44 s43)
        (adj s43 s53) (adj s53 s43)
        (adj s44 s45) (adj s45 s44)
        (adj s44 s54) (adj s54 s44)
        (adj s45 s46) (adj s46 s45)
        (adj s45 s55) (adj s55 s45)
        (adj s46 s56) (adj s56 s46)
        (adj s51 s52) (adj s52 s51)
        (adj s51 s61) (adj s51 s61)
        (adj s52 s53) (adj s53 s52)
        (adj s52 s62) (adj s62 s52)
        (adj s53 s54) (adj s54 s53)
        (adj s53 s63) (adj s63 s53)
        (adj s54 s55) (adj s55 s54)
        (adj s54 s64) (adj s64 s54)
        (adj s55 s56) (adj s56 s55)
        (adj s55 s65) (adj s65 s55)
        (adj s56 s66) (adj s66 s56)
        (adj s61 s62) (adj s62 s61)
        (adj s62 s63) (adj s63 s62)
        (adj s63 s64) (adj s64 s63)
        (adj s64 s65) (adj s65 s64)
        (adj s65 s66) (adj s66 s65)
        

        ; cat
        (at c s11)

        ; mice
        (at m1 s12)
        (at m2 s21)
        (at m3 s24)
        (at m4 s46)
        (at m5 s51)
        (at m6 s53)
        (at m7 s62)
        (at m8 s66)

        ; walls
        (at w1 s23)
        (at w2 s35)
        (at w3 s43)
        (at w4 s52)
        (at w5 s55)

        ; trap
        (at t1 s15)
        (at t2 s32)
        (at t3 s42)
        (at t4 s54)
        (at t5 s61)
        
    )

    (:goal (and (dead m1) (dead m2) (dead m3) (dead m4) (dead m5) (dead m6) (dead m7) (dead m8)))
)

; plan
1. (move c s11 s21)
   deleted: (at c s11)
   added: (at c s21)
   goals met: 0 of 8
2. (eat c s21 m2)
   deleted: (at m2 s21)
   added: (dead m2)
   goals met: 1 of 8
3. (move c s21 s31)
   deleted: (at c s21)
   added: (at c s31)
   goals met: 1 of 8
4. (move c s31 s41)
   deleted: (at c s31)
   added: (at c s41)
   goals met: 1 of 8
5. (move c s41 s51)
   deleted: (at c s41)
   added: (at c s51)
   goals met: 1 of 8
6. (grab c s51 m5)
   deleted: (at m5 s51)
   added: (has c m5)
   goals met: 1 of 8
7. (disable-trap c s51 s61 m5 t5)
   deleted: (at t5 s61) (has c m5)
   added: (dead m5)
   goals met: 2 of 8
8. (move c s51 s61)
   deleted: (at c s51)
   added: (at c s61)
   goals met: 2 of 8
9. (move c s61 s62)
   deleted: (at c s61)
   added: (at c s62)
   goals met: 2 of 8
10. (eat c s62 m7)
   deleted: (at m7 s62)
   added: (dead m7)
   goals met: 3 of 8
11. (move c s62 s63)
   deleted: (at c s62)
   added: (at c s63)
   goals met: 3 of 8
12. (move c s63 s53)
   deleted: (at c s63)
   added: (at c s53)
   goals met: 3 of 8
13. (eat c s53 m6)
   deleted: (at m6 s53)
   added: (dead m6)
   goals met: 4 of 8
14. (move c s53 s63)
   deleted: (at c s53)
   added: (at c s63)
   goals met: 4 of 8
15. (move c s63 s64)
   deleted: (at c s63)
   added: (at c s64)
   goals met: 4 of 8
16. (move c s64 s65)
   deleted: (at c s64)
   added: (at c s65)
   goals met: 4 of 8
17. (move c s65 s66)
   deleted: (at c s65)
   added: (at c s66)
   goals met: 4 of 8
18. (eat c s66 m8)
   deleted: (at m8 s66)
   added: (dead m8)
   goals met: 5 of 8
19. (move c s66 s56)
   deleted: (at c s66)
   added: (at c s56)
   goals met: 5 of 8
20. (move c s56 s46)
   deleted: (at c s56)
   added: (at c s46)
   goals met: 5 of 8
21. (eat c s46 m4)
   deleted: (at m4 s46)
   added: (dead m4)
   goals met: 6 of 8
22. (move c s46 s36)
   deleted: (at c s46)
   added: (at c s36)
   goals met: 6 of 8
23. (move c s36 s26)
   deleted: (at c s36)
   added: (at c s26)
   goals met: 6 of 8
24. (move c s26 s25)
   deleted: (at c s26)
   added: (at c s25)
   goals met: 6 of 8
25. (move c s25 s24)
   deleted: (at c s25)
   added: (at c s24)
   goals met: 6 of 8
26. (eat c s24 m3)
   deleted: (at m3 s24)
   added: (dead m3)
   goals met: 7 of 8
27. (move c s24 s14)
   deleted: (at c s24)
   added: (at c s14)
   goals met: 7 of 8
28. (move c s14 s13)
   deleted: (at c s14)
   added: (at c s13)
   goals met: 7 of 8
29. (move c s13 s12)
   deleted: (at c s13)
   added: (at c s12)
   goals met: 7 of 8
30. (eat c s12 m1)
   deleted: (at m1 s12)
   added: (dead m1)
   goals met: 8 of 8
